var streets = [
  {
    "ukr_name": "Артема",
    "ukr_type": "пров.",
    "rus_name": "Артема",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61023",
    "description": "Артем (Федір Андрійович Сергеєв) (1883-1921) - радянський партійний та державний діяч, голова Раднаркому Донецько-Криворізької Радянської Республіки (1918), заступник голови і нарком радянської пропаганди Тимчасового робітничо-селянського уряду України (1918-1919), голова Донецького губвиконкому (1920), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Артема",
    "ukr_type": "вул.",
    "rus_name": "Артема",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002, 61023",
    "description": "Артем (Федір Андрійович Сергеєв) (1883-1921) - радянський партійний та державний діяч, голова Раднаркому Донецько-Криворізької Радянської Республіки (1918), заступник голови і нарком радянської пропаганди Тимчасового робітничо-селянського уряду України (1918-1919), голова Донецького губвиконкому (1920), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Бакинских Комиссаров",
    "ukr_type": "вул.",
    "rus_name": "Бакинских Комиссаров",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61013",
    "description": "Члени Бакинського Раднаркому (1918) - азербайджанського радянського уряду, учасники встановлення радянської влади в Азербайджані."
  },
  {
    "ukr_name": "Бабушкіна",
    "ukr_type": "вул.",
    "rus_name": "Бабушкина",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61093",
    "description": "Іван Васильович Бабушкін (1873-1906) - російський більшовик, професійний революціонер, один з учнів і соратників В. І. Леніна"
  },
  {
    "ukr_name": "Бадаєва",
    "ukr_type": "вул.",
    "rus_name": "Бадаева",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Бадаєв Олексій Григорович (1883-1951) - радянський і партійний діяч, учасник Жовтневого перевороту, член ЦК ВКП(б) (1925-1951), нарком харчової промисловості (1937-1938) РРФСР, голова Президіуму ВР РРФСР (1938-1944), заступник голови Президіуму ВР СРСР (1938-1944)."
  },
  {
    "ukr_name": "Бауманська",
    "ukr_type": "вул.",
    "rus_name": "Бауманская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Бауман Микола Ернестович (1873-1905) - російський революціонер, більшовик, керівник Московської організації більшовицького крила РСДРП та Північного бюро РСДРП(б) (1903), організатор підпільної більшовицької типографії."
  },
  {
    "ukr_name": "Більшовицька",
    "ukr_type": "вул.",
    "rus_name": "Большевистская",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61044",
    "description": "Більшовики - члени ліворадикального (ленінського) крила в РСДРП, члени РКП(б) - ВКП(б) - КПРС, організатори Жовтневого перевороту 1917 р."
  },
  {
    "ukr_name": "Більшовицький",
    "ukr_type": "пров.",
    "rus_name": "Большевистский",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61019",
    "description": "Більшовики - члени ліворадикального (ленінського) крила в РСДРП, члени РКП(б) - ВКП(б) - КПРС, організатори Жовтневого перевороту 1917 р."
  },
  {
    "ukr_name": "Благоєва",
    "ukr_type": "вул.",
    "rus_name": "Благоева",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61052",
    "description": "Дмитро Благоєв Ніколов (1856-1924) - засновник і керівник Болгарської комуністичної партії"
  },
  {
    "ukr_name": "Блюхера",
    "ukr_type": "вул.",
    "rus_name": "Блюхера",
    "rus_type": "ул.",
    "district": "Київський, Московський",
    "postcode": "61121, 61123, 61142, 61146, 61168, 61170",
    "description": "Блюхер Василь Костянтинович (1890-1938) - радянський військовий діяч, Маршал Радянського Союзу, Член ВКП(б) з 1916, з 1934 — кандидат в члени ЦК ВКП(б), головнокомандувач, військовий міністр і голова Військової ради Далекосхідної республіки (1921- 1922), командир 1-го корпусу і начальник Петроградського укріпленого району, заступник командувача військами Українського військового округу."
  },
  {
    "ukr_name": "Богунського",
    "ukr_type": "вул.",
    "rus_name": "Богунского",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61046",
    "description": "Антоній Савович Шарій-Богунський (1899-1919) - командир 1-го українського радянського (Богунського) полку (1918-1919) Червоної армії, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Богунського",
    "ukr_type": "пров.",
    "rus_name": "Богунского",
    "rus_type": "пер.",
    "district": "Фрунзенський",
    "postcode": "61046",
    "description": "Антоній Савович Шарій-Богунський (1899-1919) - командир 1-го українського радянського (Богунського) полку (1918-1919) Червоної армії, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Буздаліна",
    "ukr_type": "вул.",
    "rus_name": "Буздалина",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Буздалін Сергій Феоктистович (1892-1938) - радянський державний і політичний діяч, народний комісар юстиції УСРР і голова Верховного революційного трибуналу, Голова Верховного Суду УСРР (1921-1923), в. о. наркома внутрішніх справ УСРР (1924)"
  },
  {
    "ukr_name": "Василевської Ванди",
    "ukr_type": "в-д",
    "rus_name": "Василевской Ванды",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Василевська Ванда Львівна (1905-1964) - польська та радянська письменниця, громадська діячка, член ВКП(б), написала донос Сталіну на Євгена Степановича Березняка («Майор Вихор»)"
  },
  {
    "ukr_name": "Василевської Ванди",
    "ukr_type": "вул.",
    "rus_name": "Василевской Ванды",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Василевська Ванда Львівна (1905-1964) - польська та радянська письменниця, громадська діячка, член ВКП(б), написала донос Сталіну на Євгена Степановича Березняка («Майор Вихор»)"
  },
  {
    "ukr_name": "Василевської Ванди",
    "ukr_type": "пров.",
    "rus_name": "Василевской Ванды",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Василевська Ванда Львівна (1905-1964) - польська та радянська письменниця, громадська діячка, член ВКП(б), написала донос Сталіну на Євгена Степановича Березняка («Майор Вихор»)"
  },
  {
    "ukr_name": "Височиненка",
    "ukr_type": "вул.",
    "rus_name": "Высочиненко",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Височиненко Семен Дмитрович (1890-1938) - партійний та комсомольський діяч, учасник встановлення радянської влади в Україні, секретар Харківського губернського комітету, ЦК Ленінськоїкомуністичної спілки молоді України (1924-1925), генеральний секретар ЦК ЛКСМУ (192501927)."
  },
  {
    "ukr_name": "Войкова",
    "ukr_type": "вул.",
    "rus_name": "Войкова",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61036",
    "description": "Войков Петро Лазаревич (1888-1927) - радянський партійний та державний діяч, брав участь у встановленні радянської влади в Росії, член Єкатеринбурзької ради та ВРК (1917-1918), один з організаторів та учасників убивства імператорської сродини у 1918 р., займався знищенням тіл убитих."
  },
  {
    "ukr_name": "Володарського",
    "ukr_type": "вул.",
    "rus_name": "Володарского",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039, 61064, 61093",
    "description": "В. Володарський (Мойсей Маркович Гольдштейн) (1891-1918) - російський більшовик, учасник Жовтневого перевороту 1917 р., головний агітатор Петроградського комітету РКП(б), член Президіуму ВЦВК. Убивство Володарського було використано як привід для розгортання червоного терору."
  },
  {
    "ukr_name": "Володарського",
    "ukr_type": "пров.",
    "rus_name": "Володарского",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61064",
    "description": "В. Володарський (Мойсей Маркович Гольдштейн) (1891-1918) - російський більшовик, учасник Жовтневого перевороту 1917 р., головний агітатор Петроградського комітету РКП(б), член Президіуму ВЦВК. Убивство Володарського було використано як привід для розгортання червоного терору."
  },
  {
    "ukr_name": "Володарського",
    "ukr_type": "в-д",
    "rus_name": "Володарского",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61064",
    "description": "В. Володарський (Мойсей Маркович Гольдштейн) (1891-1918) - російський більшовик, учасник Жовтневого перевороту 1917 р., головний агітатор Петроградського комітету РКП(б), член Президіуму ВЦВК. Убивство Володарського було використано як привід для розгортання червоного терору."
  },
  {
    "ukr_name": "Воровського",
    "ukr_type": "вул.",
    "rus_name": "Воровского",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Воровський Вацлав Вацлавович (1871-1923) - російський революціонер, більшовик, полпред Раднаркому в Скандинавії (1917-1919), Італії (1921), ініціатор гонінь проти православної церкви."
  },
  {
    "ukr_name": "Галана",
    "ukr_type": "вул.",
    "rus_name": "Галана",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61058",
    "description": "Галан Олександр Ярославович (1902-1949) - український радянський письменник, журналіст, громадський і політичний діяч, член Комуністичної Партії Західної України (з 1924 р.), автор пропагандистських фальсифікаторських публікацій, у яких піддавав цькуванню християнську церкву, український визвольний рух, звеличувався сталінський режим."
  },
  {
    "ukr_name": "Гамарника",
    "ukr_type": "вул.",
    "rus_name": "Гамарника",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61003",
    "description": "Гамарник Ян Борисович (1894-1937) - радянський партійний, державний і військовий діяч. Керівник київських більшовиків у 1917-1918 роках. Голова Київського губ ревкому та губвиконкому (1920-1923), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Гамарника",
    "ukr_type": "пров.",
    "rus_name": "Гамарника",
    "rus_type": "пер.",
    "district": "Фрунзенський",
    "postcode": "61110",
    "description": "Гамарник Ян Борисович (1894-1937) - радянський партійний, державний і військовий діяч. Керівник київських більшовиків у 1917-1918 роках. Голова Київського губ ревкому та губвиконкому (1920-1923), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Ганни",
    "ukr_type": "вул.",
    "rus_name": "Ганны",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61001",
    "description": "Хоперська Ганна Петрівна (1893-1920) - революціонерка-більшовик, учасниця встановлення радянської влади на Харківщині."
  },
  {
    "ukr_name": "Губкомівська",
    "ukr_type": "вул.",
    "rus_name": "Губкомовская",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61093",
    "description": "Губком - Губернський комітет Російської комуністичної партії (більшовиків)"
  },
  {
    "ukr_name": "Дацька",
    "ukr_type": "вул.",
    "rus_name": "Дацько",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61017",
    "description": "Дацько Йосип (?-1919) - член Харківського більшовицького підпілля, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Демченка",
    "ukr_type": "вул.",
    "rus_name": "Демченко",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Демченко Микола Нестерович (1896-1937) - радянський партійний та державний діяч, нарком землеробства УСРР (1930-1932), перший секретар Київського (1932-1934) та Харківського обкому (1934- 1936) член Политбюро ЦК КП(б)У (1931-1937)."
  },
  {
    "ukr_name": "Дибенка Павла",
    "ukr_type": "вул.",
    "rus_name": "Дыбенко Павла",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Дибенко Павло Юхимович (1889-1938) - радянський військовий і державний діяч, перший наркомвійськмор Радянської Росії, учасник встановлення радянської влади в Україні та Росії."
  },
  {
    "ukr_name": "Дибенка Павла",
    "ukr_type": "пров.",
    "rus_name": "Дыбенко Павла",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Дибенко Павло Юхимович (1889-1938) - радянський військовий і державний діяч, перший наркомвійськмор Радянської Росії, учасник встановлення радянської влади в Україні та Росії."
  },
  {
    "ukr_name": "Дніпропетровська",
    "ukr_type": "вул.",
    "rus_name": "Днепропетровская",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61015, 61016",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Дніпропетровський",
    "ukr_type": "пр-д",
    "rus_name": "Днепропетровский",
    "rus_type": "пр-д",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Дніпропетровський",
    "ukr_type": "пров.",
    "rus_name": "Днепропетровский",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61015",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Доброхотова",
    "ukr_type": "вул.",
    "rus_name": "Доброхотова",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61037",
    "description": "Доброхотов Михайло Петрович (1871-1919) - російський революціонер-більшовик, керівник більшовицького підпілля в Харкові (1906-1913), учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Другої П’ятирічки",
    "ukr_type": "вул.",
    "rus_name": "Второй Пятилетки",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61055, 61115",
    "description": "Другої П’ятирічка (1933-1937) - другий п‘ятирічний план розвитку народного господарства СРСР, «П‘ятирічка колективізації», «Безбожна п‘ятирічка»."
  },
  {
    "ukr_name": "Дубового",
    "ukr_type": "пров.",
    "rus_name": "Дубового",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61003",
    "description": "Дубовий Іван Наумович (1896-1938) - радянський військовий діяч, військовий комісар, комендант, начальник зв’язку Центрального штабу Червоної гвардії Донбасу (1918-1919), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Ейдемана Роберта",
    "ukr_type": "вул.",
    "rus_name": "Эйдемана Роберта",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61112, 61118",
    "description": "Ейдеман Роберт Петрович (1895-1937) - радянський військовий діяч, учасник встановлення радянської влади в Україні, один з організаторів червоного терору, командувач військами Харківського військового округу, помічник командувач Збройними Силами України і Криму (1921), член Всеукраїнського Центрального Виконавчого Комітету."
  },
  {
    "ukr_name": "Енгельса",
    "ukr_type": "вул.",
    "rus_name": "Энгельса",
    "rus_type": "ул.",
    "district": "Ленінський, Жовтневий",
    "postcode": "61012",
    "description": "Енгельс Фрідріх (1820-1895) - основоположник марксизму, ідеолог комунізму, учасник міжнародного комуністичного руху."
  },
  {
    "ukr_name": "Єлізарова",
    "ukr_type": "вул.",
    "rus_name": "Елизарова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61015, 61016, 61098",
    "description": "Єлізаров Марк Тимофійович (1863-1919) - радянський державний діяч, член ВКП(б), нарком шляхів сполучення (1917-1918), чоловік Анни Ульянової - сестри В. Леніна."
  },
  {
    "ukr_name": "Єлізарова",
    "ukr_type": "пров.",
    "rus_name": "Елизарова",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Єлізаров Марк Тимофійович (1863-1919) - радянський державний діяч, член ВКП(б), нарком шляхів сполучення (1917-1918), чоловік Анни Ульянової - сестри В. Леніна."
  },
  {
    "ukr_name": "Желєзнякова",
    "ukr_type": "в-д",
    "rus_name": "Железнякова",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Желєзняков Анатолій Григорович (Матрос Желєзняк) (1895-1919) - учасник жовтневого перевороту, командир Першої радянської кінної батареї, командир бригади бронепоїздів часів громадянської війни, начальник караулу розпущених ним же Всеросійських Установчих Зборів."
  },
  {
    "ukr_name": "Желєзнякова",
    "ukr_type": "пров.",
    "rus_name": "Железнякова",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Желєзняков Анатолій Григорович (Матрос Желєзняк) (1895-1919) - учасник жовтневого перевороту, командир Першої радянської кінної батареї, командир бригади бронепоїздів часів громадянської війни, начальник караулу розпущених ним же Всеросійських Установчих Зборів."
  },
  {
    "ukr_name": "Желєзнякова",
    "ukr_type": "вул.",
    "rus_name": "Железнякова",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61102, 61109",
    "description": "Желєзняков Анатолій Григорович (Матрос Желєзняк) (1895-1919) - учасник жовтневого перевороту, командир Першої радянської кінної батареї, командир бригади бронепоїздів часів громадянської війни, начальник караулу розпущених ним же Всеросійських Установчих Зборів."
  },
  {
    "ukr_name": "Желябова",
    "ukr_type": "пров.",
    "rus_name": "Желябова",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61098",
    "description": "Желябов Андрій Іванович (1851-1881) - російський революціонер-народник, терорист, організатор і учасник убивства імператора Олександра ІІ."
  },
  {
    "ukr_name": "Жовтнева",
    "ukr_type": "вул.",
    "rus_name": "Октябрьская",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Жовтневий",
    "ukr_type": "пров.",
    "rus_name": "Октябрьский",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61005",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Жовтневий 1-й",
    "ukr_type": "в-д",
    "rus_name": "Жовтневий 1-й",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Жовтневий 2-й",
    "ukr_type": "в-д",
    "rus_name": "Жовтневий 2-й",
    "rus_type": "в-д",
    "district": "Червонозаводский",
    "postcode": "61109",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Жовтневої Революції",
    "ukr_type": "вул.",
    "rus_name": "Октябрьской Революции",
    "rus_type": "ул.",
    "district": "Жовтневий, Червонозаводський",
    "postcode": "61004, 61125, 61157",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Жовтневої Революції",
    "ukr_type": "в-д",
    "rus_name": "Октябрьской Революции",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61157",
    "description": "Названі на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Заводу Комсомолець",
    "ukr_type": "вул.",
    "rus_name": "Завода Комсомолец",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61051",
    "description": "Всесоюзний Ленінський комуністичний союз молоді (ВЛКСМ), або Комсомол — комуністичний молодіжний рух в СРСР, скорочення від «комуністичний союз молоді», структура КПРС для роботи з молоддю та виховання партійних кадрів."
  },
  {
    "ukr_name": "Загорський",
    "ukr_type": "пров.",
    "rus_name": "Загорский",
    "rus_type": "пер.",
    "district": "Комінтернівський",
    "postcode": "61105",
    "description": "Загорський Володимир Михайлович (1883-1919) - російський революціонер-більшовик, учасник встановлення радянської влади в Росії, секретар Московського комітету РКП(б)."
  },
  {
    "ukr_name": "Зеленського",
    "ukr_type": "вул.",
    "rus_name": "Зеленского",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Зеленський Тимофій Петрович (1884-1937) - революціонер-більшовик, партійний діяч, учасник встановлення радянської влади у Харкові, секретар Петінського райкому партії, другий секретар Харівського міськкому партії."
  },
  {
    "ukr_name": "Іванова",
    "ukr_type": "вул.",
    "rus_name": "Иванова",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Іванов Андрій Васильович (1888-1927) - партійний і державний діяч, один з активних організаторів повстань проти Центральної Ради (1917-1918), учасник встановлення радянської влади в Україні, Голова Київського губернського революційного комітету (1919- 1920)."
  },
  {
    "ukr_name": "Ізотова Микити",
    "ukr_type": "вул.",
    "rus_name": "Изотова Никиты",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Ізотов Микита Олексійович (1902-1951) - шахтар-ударник, засновник ізотовського руху - одного ізпропагандистських символів Другої П’ятирічки (1933-1937)."
  },
  {
    "ukr_name": "Ілліча",
    "ukr_type": "просп.",
    "rus_name": "Ильича",
    "rus_type": "просп.",
    "district": "Жовтневий",
    "postcode": "61019, 61020, 61071",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору."
  },
  {
    "ukr_name": "Ілліча",
    "ukr_type": "вул.",
    "rus_name": "Ильича",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору."
  },
  {
    "ukr_name": "Ілліча",
    "ukr_type": "пров.",
    "rus_name": "Ильича",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61137",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору."
  },
  {
    "ukr_name": "Калініна",
    "ukr_type": "вул.",
    "rus_name": "Калинина",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61019, 61020",
    "description": "Калінін Михайло Іванович (1875-1949) - радянський партійний і державний діяч, голова ЦВК СРСР (1922-1938), член Політбюро."
  },
  {
    "ukr_name": "Калініна",
    "ukr_type": "в-д",
    "rus_name": "Калинина",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61020",
    "description": "Калінін Михайло Іванович (1875-1949) - радянський партійний і державний діяч, голова ЦВК СРСР (1922-1938), член Політбюро."
  },
  {
    "ukr_name": "Калініна 2-й",
    "ukr_type": "в-д",
    "rus_name": "Калинина 2-й",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61019",
    "description": "Калінін Михайло Іванович (1875-1949) - радянський партійний і державний діяч, голова ЦВК СРСР (1922-1938), член Політбюро."
  },
  {
    "ukr_name": "Калінінградська",
    "ukr_type": "вул.",
    "rus_name": "Калининградская",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61029",
    "description": "Калінін Михайло Іванович (1875-1949) - радянський партійний і державний діяч, голова ЦВК СРСР (1922-1938), член Політбюро."
  },
  {
    "ukr_name": "Калінінградський",
    "ukr_type": "пров.",
    "rus_name": "Калининградский",
    "rus_type": "пер.",
    "district": "Фрунзенський",
    "postcode": "61029",
    "description": "Калінін Михайло Іванович (1875-1949) - радянський партійний і державний діяч, голова ЦВК СРСР (1922-1938), член Політбюро."
  },
  {
    "ukr_name": "Каляєва",
    "ukr_type": "пров.",
    "rus_name": "Каляева",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61034",
    "description": "Каляєв Іван Платонович (1877-1905) - російський революціонер, терорист, організатор та учасник убивства великого князя Сергія Олександровича."
  },
  {
    "ukr_name": "Каракозова",
    "ukr_type": "пров.",
    "rus_name": "Каракозова",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61034",
    "description": "Каракозов Дмитро Володимирович (1840-1866) - російський революціонер-народник, терорист, органзатор та учасник замаху на вбивство імператора Олександра ІІ."
  },
  {
    "ukr_name": "Карла Лібкнехта",
    "ukr_type": "вул.",
    "rus_name": "Карла Либкнехта",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Лібкнехт Карл (1871-1919) - діяч німецького та міжнародного комуністичного руху, засновник Комуністичної партії Німеччини, організатор невдалої спроби комуністичного перевороту в Німеччині (1919)."
  },
  {
    "ukr_name": "Карла Маркса",
    "ukr_type": "вул.",
    "rus_name": "Карла Маркса",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61012, 61052",
    "description": "Маркс Карл (1818-1883) - німецький філософ, економіст, політичний діяч, основоположникмарксизму, ідеолог комунізму, учасник міжнародного комуністичного руху."
  },
  {
    "ukr_name": "Кіквідзе",
    "ukr_type": "вул.",
    "rus_name": "Киквидзе",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Кіквідзе Василь Ісідорович (1895-1919) - радянський військовий діяч, учасник встановлення радянської влади, організатор єврейських погромів в Україні."
  },
  {
    "ukr_name": "Кіквідзе",
    "ukr_type": "пров.",
    "rus_name": "Киквидзе",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Кіквідзе Василь Ісідорович (1895-1919) - радянський військовий діяч, учасник встановлення радянської влади, організатор єврейських погромів в Україні."
  },
  {
    "ukr_name": "Кірова",
    "ukr_type": "вул.",
    "rus_name": "Кирова",
    "rus_type": "ул.",
    "district": "Комінтернівський, Червонозаводський",
    "postcode": "61001, 61140",
    "description": "Кіров Сергій Миронович (1886-1934) - радянський державний і політичний діяч. Перший секретар Ленінградського міського комітету ВКП(б) і член Політбюро ЦК ВКП(б)."
  },
  {
    "ukr_name": "Кіровська",
    "ukr_type": "вул.",
    "rus_name": "Кировская",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Кіров Сергій Миронович (1886-1934) - радянський державний і політичний діяч. Перший секретар Ленінградського міського комітету ВКП(б) і член Політбюро ЦК ВКП(б)."
  },
  {
    "ukr_name": "Клапцова",
    "ukr_type": "вул.",
    "rus_name": "Клапцова",
    "rus_type": "ул.",
    "district": "Ленінський, Жовтневий",
    "postcode": "61064, 61093",
    "description": "Клапцов Дмитро Іванович (1895-1938) - один з організаторів і керівників Комсомолу на Харківщині, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Козлова",
    "ukr_type": "вул.",
    "rus_name": "Козлова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61040",
    "description": "Козлов Іван Андрійович (1888-1957) - радянський партійний діяч, член більшовицького підпілля у Харкові та Севастополі (1917-1919), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Колгоспна",
    "ukr_type": "вул.",
    "rus_name": "Колхозная",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61064",
    "description": "Колгосп (від скорочення — колективне господарство; рос. колхоз) — форма сільськогосподарського підприємства в СРСР, стала масовою формою господарювання під час кампанії з форсованої колективізації (1929-1933), яка призвела до Голодомору 1932-1933 рр."
  },
  {
    "ukr_name": "Колгоспний",
    "ukr_type": "в-д",
    "rus_name": "Колхозный",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61085",
    "description": "Колгосп (від скорочення — колективне господарство; рос. колхоз) — форма сільськогосподарського підприємства в СРСР, стала масовою формою господарювання під час кампанії з форсованої колективізації (1929-1933), яка призвела до Голодомору 1932-1933 рр."
  },
  {
    "ukr_name": "Колгоспний",
    "ukr_type": "в-д",
    "rus_name": "Колхозный",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61107",
    "description": "Колгосп (від скорочення — колективне господарство; рос. колхоз) — форма сільськогосподарського підприємства в СРСР, стала масовою формою господарювання під час кампанії з форсованої колективізації (1929-1933), яка призвела до Голодомору 1932-1933 рр."
  },
  {
    "ukr_name": "Коллонтай",
    "ukr_type": "пров.",
    "rus_name": "Коллонтай",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61067",
    "description": "Коллонтай Олександра Михайлівна (1872-1952) - російська революціонерка, державний діяч, учасниця Жовтневого перевороту, член першого Раднаркому, ініціатор реквізиції Олександро-Невської лаври, убивства її протоієрея Петра Кіпетрова, у 1927-1945 - на дипломатичній роботі."
  },
  {
    "ukr_name": "Командарма Корка",
    "ukr_type": "вул.",
    "rus_name": "Командарма Корка",
    "rus_type": "ул.",
    "district": "Київський, Московський",
    "postcode": "61107, 61184, 61195",
    "description": "Корк Август Іванович (1887-1937) - радянський військовий діяч, учасник встановлення радянської влади в Росії, Україні, Середній Азії."
  },
  {
    "ukr_name": "Комсомольська",
    "ukr_type": "вул.",
    "rus_name": "Комсомольская",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61030, 61035",
    "description": "Всесоюзний Ленінський комуністичний союз молоді (ВЛКСМ), або Комсомол — комуністичний молодіжний рух в СРСР, скорочення від «комуністичний союз молоді», структура КПРС для роботи з молоддю та виховання партійних кадрів."
  },
  {
    "ukr_name": "Комсомольське",
    "ukr_type": "шосе",
    "rus_name": "Комсомольское",
    "rus_type": "шоссе",
    "district": "Жовтневий",
    "postcode": "61020, 61034, 61064",
    "description": "Всесоюзний Ленінський комуністичний союз молоді (ВЛКСМ), або Комсомол — комуністичний молодіжний рух в СРСР, скорочення від «комуністичний союз молоді», структура КПРС для роботи з молоддю та виховання партійних кадрів."
  },
  {
    "ukr_name": "Комсомольський",
    "ukr_type": "пров.",
    "rus_name": "Комсомольский",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Всесоюзний Ленінський комуністичний союз молоді (ВЛКСМ), або Комсомол — комуністичний молодіжний рух в СРСР, скорочення від «комуністичний союз молоді», структура КПРС для роботи з молоддю та виховання партійних кадрів."
  },
  {
    "ukr_name": "Комуни",
    "ukr_type": "вул.",
    "rus_name": "Коммуны",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61044",
    "description": "Комуна - форма суспільної організації, одне з ключових понять комуністичного вчення; форма соціалістичної сільськогосподарської та промислової кооперації у Радянськіій Росії та СРСР у 1918-1920-х рр."
  },
  {
    "ukr_name": "Корчагінців",
    "ukr_type": "вул.",
    "rus_name": "Корчагинцев",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61029, 61171, 61176, 61178",
    "description": "Корчагінці - учасники комсомольського руху, натхнені життєвим прикладом головного героя романа М. Островського «Як гартувалась сталь» (1932) Павла Корчагіна - комсомольця, учасника громадянської війни та встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Косіора",
    "ukr_type": "пров.",
    "rus_name": "Косиора",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61037",
    "description": "Косіор Станіслав Вікентійович (1889-1939) - радянський партійний та державний діяч, генеральний секретар та перший секретар ЦК КП(б)У (1928-1938). 13 січня 2010 року Апеляційний суд міста Києва, здійснивши попередній розгляд кримінальної справи № 1-33/2010, порушеної Службою безпеки України за фактом вчинення геноциду в Україні в 1932—1933 роках за ознаками злочину, передбаченого ч. 1 ст. 442 КК України, визнав Косіора винним у організації Голодомору та постановив наступне: «Підстав для реабілітації Косіора Станіслава Вікентійович немає»."
  },
  {
    "ukr_name": "Косіора",
    "ukr_type": "просп.",
    "rus_name": "Косиора",
    "rus_type": "просп.",
    "district": "Орджонікідзевський, Фрунзенський",
    "postcode": "61007, 61046, 61075, 61089, 61115",
    "description": "Косіор Станіслав Вікентійович (1889-1939) - радянський партійний та державний діяч, генеральний секретар та перший секретар ЦК КП(б)У (1928-1938). 13 січня 2010 року Апеляційний суд міста Києва, здійснивши попередній розгляд кримінальної справи № 1-33/2010, порушеної Службою безпеки України за фактом вчинення геноциду в Україні в 1932—1933 роках за ознаками злочину, передбаченого ч. 1 ст. 442 КК України, визнав Косіора винним у організації Голодомору та постановив наступне: «Підстав для реабілітації Косіора Станіслава Вікентійович немає»."
  },
  {
    "ukr_name": "Котлова",
    "ukr_type": "вул.",
    "rus_name": "Котлова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61017, 61040, 61052, 61139",
    "description": "Котлов Іван Федорович (1873-1920) - революціонер, учасник боротьби за встановлення радянської влади в Харкові, керівник Харківської підпільної організації КП(б)У (1918-1919)."
  },
  {
    "ukr_name": "Котовського",
    "ukr_type": "вул.",
    "district": "Київський, Московський",
    "rus_name": "Котовского",
    "rus_type": "ул.",
    "postcode": "61161",
    "description": "Котовський Григорій Іванович (1881-1925) - радянський військовий та політичний діяч, учасник встановлення радянської влади в Україні, командувач Тираспольського загону збройних сил Одеської Радянської Республіки (1918), член Всеросійського ЦВК, член Реввійськради СРСР."
  },
  {
    "ukr_name": "Котовського",
    "ukr_type": "в-д",
    "rus_name": "Котовского",
    "rus_type": "в-д",
    "district": "Московський",
    "postcode": "61161",
    "description": "Котовський Григорій Іванович (1881-1925) - радянський військовий та політичний діяч, учасник встановлення радянської влади в Україні, командувач Тираспольського загону збройних сил Одеської Радянської Республіки (1918), член Всеросійського ЦВК, член Реввійськради СРСР."
  },
  {
    "ukr_name": "Котовського",
    "ukr_type": "пров.",
    "rus_name": "Котовского",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61161",
    "description": "Котовський Григорій Іванович (1881-1925) - радянський військовий та політичний діяч, учасник встановлення радянської влади в Україні, командувач Тираспольського загону збройних сил Одеської Радянської Республіки (1918), член Всеросійського ЦВК, член Реввійськради СРСР."
  },
  {
    "ukr_name": "Красіна",
    "ukr_type": "вул.",
    "rus_name": "Красина",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Красін Леонід Борисович (1870-1926) - радянський державний та політичний діяч, голова підпільної більшовицької терористичної групи «Бойової технічної групи», один з організаторів убивства мецената та підприємця Сави Морозова (1905), голова надзвичайної комісії по постачанню Червоної армії (1918), член Президії ВРНГ, нарком торгівлі і промисловості РСФРР (1918 —1920), нарком шляхів сполучення РСФРР (1919 —1920), нарком зовнішньої торгівлі РСФРР та СРСР (1920 — 1925)."
  },
  {
    "ukr_name": "Краснодонська",
    "ukr_type": "вул.",
    "rus_name": "Краснодонская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61004, 61125",
    "description": "Краснодон (до 1938 р. - Сорокине) - місто в Луганській області, перейменоване із залученням до назви елементів радянської державної символіки («Червоний Дон»)."
  },
  {
    "ukr_name": "Краснодонський",
    "ukr_type": "пров.",
    "rus_name": "Краснодонский",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61125",
    "description": "Краснодон (до 1938 р. - Сорокине) - місто в Луганській області, перейменоване із залученням до назви елементів радянської державної символіки («Червоний Дон»)."
  },
  {
    "ukr_name": "Крейсера Аврора",
    "ukr_type": "вул.",
    "rus_name": "Крейсера Аврора",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61015, 61016",
    "description": "«Аврора» - крейсер Балтійського флоту, 25 жовтня (7 листопада) 1917 р. гарматним пострілом подала сигнал до штурму Зимового палацу, що стало початком більшовицького збройного перевороту. Один із символів Жовтневого перевороту."
  },
  {
    "ukr_name": "Крейсера Аврора",
    "ukr_type": "пров.",
    "rus_name": "Крейсера Аврора",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "«Аврора» - крейсер Балтійського флоту, 25 жовтня (7 листопада) 1917 р. гарматним пострілом подала сигнал до штурму Зимового палацу, що стало початком більшовицького збройного перевороту. Один із символів Жовтневого перевороту."
  },
  {
    "ukr_name": "Кривомазова",
    "ukr_type": "вул.",
    "rus_name": "Кривомазова",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61157",
    "description": "Кривомазов Михайло (Микола?) Іванович (1896- 1918) - революціонер-більшовик, начальник бойової дружини Основянсько-Холодногірського району Харкова, учасник боротьби за встановлення радянської влади."
  },
  {
    "ukr_name": "Кривомазова",
    "ukr_type": "пров.",
    "rus_name": "Кривомазова",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61009",
    "description": "Кривомазов Михайло (Микола?) Іванович (1896- 1918) - революціонер-більшовик, начальник бойової дружини Основянсько-Холодногірського району Харкова, учасник боротьби за встановлення радянської влади."
  },
  {
    "ukr_name": "Крупської",
    "ukr_type": "вул.",
    "rus_name": "Крупской",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Крупська Надія Костянтинівна (1869-1939) - радянський державний та громадський діяч, голова Головполітосвіти (1920-1929), дружина В. І. Леніна."
  },
  {
    "ukr_name": "Крупської",
    "ukr_type": "наб.",
    "rus_name": "Крупской",
    "rus_type": "наб.",
    "district": "Московський",
    "postcode": "61068",
    "description": "Крупська Надія Костянтинівна (1869-1939) - радянський державний та громадський діяч, голова Головполітосвіти (1920-1929), дружина В. І. Леніна."
  },
  {
    "ukr_name": "Кубасова",
    "ukr_type": "вул.",
    "rus_name": "Кубасова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Кубасов Федір Васильович (1901-1919) - учасник боротьби за встановлення радянської влади в Харкові, секретар Холодногірського райкому комсомолу."
  },
  {
    "ukr_name": "Куйбишева",
    "ukr_type": "пров.",
    "rus_name": "Куйбышева",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61050",
    "description": "Куйбишев Валеріан Володимирович (1888-1935) - радянський державний діяч, член Політбюро ЦК ВКП (б) (1930-1935), член Оргбюро ЦК ВКП (б) (1922-1923, 1934-1935), секретар ЦК ВКП (б) (1922-1923), член ЦК ВКП (б) (1923-1927)."
  },
  {
    "ukr_name": "Куйбишева",
    "ukr_type": "вул.",
    "rus_name": "Куйбышева",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61050",
    "description": "Куйбишев Валеріан Володимирович (1888-1935) - радянський державний діяч, член Політбюро ЦК ВКП (б) (1930-1935), член Оргбюро ЦК ВКП (б) (1922-1923, 1934-1935), секретар ЦК ВКП (б) (1922-1923), член ЦК ВКП (б) (1923-1927)."
  },
  {
    "ukr_name": "Культкомівський",
    "ukr_type": "пров.",
    "rus_name": "Культкомовский",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Культурна комісія (Культком) - назва радянських партійних, профспілкових, громадських культурних відділів у 1920-1930-х рр."
  },
  {
    "ukr_name": "Культкомівський",
    "ukr_type": "в-д",
    "rus_name": "Культкомовский",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Культурна комісія (Культком) - назва радянських партійних, профспілкових, громадських культурних відділів у 1920-1930-х рр."
  },
  {
    "ukr_name": "Куусінська",
    "ukr_type": "вул.",
    "rus_name": "Куусинская",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Куусінен Отто Вільгельмович (1881-1964) - радянський політичний діяч, учасник боротьби за встановлення радянської влади у Фінляндії (1918), Голова Президіуму Верховної Ради Карело-Фінської Соціалістичної Радянської Республіки (1940-1956)"
  },
  {
    "ukr_name": "Лазо",
    "ukr_type": "вул.",
    "rus_name": "Лазо",
    "rus_type": "ул.",
    "district": "Київський, Московський",
    "postcode": "61013, 61161",
    "description": "Лазо Сергій Георгійович (1894-1920) - радянський військовий та політичний діяч, учасник встановлення радянської влади у Сибіру та на Далекому Сході"
  },
  {
    "ukr_name": "Латиських Червоних Стрільців",
    "ukr_type": "вул.",
    "rus_name": "Латышских Красных Стрелков",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Латиські червоні стрілки - особовий склад стрілецьких частин, сформованих з мешканців Ліфляндської, Курляндської та Вітебської губерній, які після Жовтневого перевороту перейшли на бік більшовиків; брали участь у придушенні антибільшовицьких повстань в Росії та Україні, учасники встановлення радянської влади."
  },
  {
    "ukr_name": "Лафарга",
    "ukr_type": "пров.",
    "rus_name": "Лафарга",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61110",
    "description": "Лафарг Поль (1842-1911) - французький політичний діяч, учасник комуністичного руху, зять Карла Маркса."
  },
  {
    "ukr_name": "Лафарга",
    "ukr_type": "вул.",
    "rus_name": "Лафарга",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61110",
    "description": "Лафарг Поль (1842-1911) - французький політичний діяч, учасник комуністичного руху, зять Карла Маркса."
  },
  {
    "ukr_name": "Лебедєва Павла",
    "ukr_type": "вул.",
    "rus_name": "Лебедева Павла",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61045",
    "description": "Лебедєв Павло Павлович (1872-1933) - радянський військовий діяч, начальник польового штабу РСФРР і Штабу РСЧА (1919-1924), член Реввійськради СРСР (1923-1924), учасник встановлення радянської влади в Росії та Україні."
  },
  {
    "ukr_name": "Леніна",
    "ukr_type": "вул.",
    "rus_name": "Ленина",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61166",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Леніна",
    "ukr_type": "просп.",
    "rus_name": "Ленина",
    "rus_type": "просп.",
    "district": "Дзержинський",
    "postcode": "61022, 61058, 61072, 61103, 61145, 61166",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Ленінградська",
    "ukr_type": "вул.",
    "rus_name": "Ленинградская",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Ленінградський",
    "ukr_type": "в-д",
    "rus_name": "Ленинградский",
    "rus_type": "в-д",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Ленінська",
    "ukr_type": "вул.",
    "rus_name": "Ленинская",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Луначарського",
    "ukr_type": "вул.",
    "rus_name": "Луначарского",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61020, 61137",
    "description": "Луначарський Анатолій Васильович (1875 - 1933) — російський письменник, журналіст, марксист, політик-більшовик, нарком освіти СРСР (1917-1929), академік АН СССР (1933). Один з основоположників так званої пролетарської літератури"
  },
  {
    "ukr_name": "Марселя Кашена",
    "ukr_type": "вул.",
    "rus_name": "Марселя Кашена",
    "rus_type": "ул.",
    "district": "Київський, Московський",
    "postcode": "61161",
    "description": "Марсель Кашен (1869 - 1958) — діяч міжнародного комуністичного руху, французький комуніст, член Комінтерну."
  },
  {
    "ukr_name": "Межлаука",
    "ukr_type": "вул.",
    "rus_name": "Межлаука",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61082",
    "description": "Валерій Іванович Межлаук (1893-1938) - радянський партійний і державний діяч. У лютому-квітні 1918 року нарком фінансів Донецько-Криворізької республіки, член Донецького обкому РКП (б.) Один з головних теоретиків і організаторів системи радянського планування і розподілу"
  },
  {
    "ukr_name": "Менжинського",
    "ukr_type": "вул.",
    "rus_name": "Менжинского",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61036",
    "description": "Менжинський В’ячеслав Рудольфович (1847-1934) - радянський державний і партійний діяч, учасникжовтневого перевороту, нарком Робітничо-селянської інспекції (1919), один із засновників ЧК, голова ОДПУ (1926-1934)"
  },
  {
    "ukr_name": "Морозова Павліка",
    "ukr_type": "вул.",
    "rus_name": "Морозова Павлика",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61108",
    "description": "Павло Трохимович Морозов (1918—1932), відоміший як Павлик Морозов — хлопчик, який в радянській пропаганді символізував чесність і принциповість молодого борця з «куркулями»."
  },
  {
    "ukr_name": "Муранова",
    "ukr_type": "вул.",
    "rus_name": "Муранова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61016, 61093",
    "description": "Муранов Матвій Костянтинович (1873-1959) — російський революціонер, радянський партіний та державний діяч. У 1917 році заступник наркома внутрішніх справ РСФРР. З 1923 по 1934 рр. член Верховного суду СРСР."
  },
  {
    "ukr_name": "Муранова",
    "ukr_type": "пров.",
    "rus_name": "Муранова",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61093",
    "description": "Муранов Матвій Костянтинович (1873-1959) — російський революціонер, радянський партіний та державний діяч. У 1917 році заступник наркома внутрішніх справ РСФРР. З 1923 по 1934 рр. член Верховного суду СРСР."
  },
  {
    "ukr_name": "Наріманова",
    "ukr_type": "вул.",
    "rus_name": "Нариманова",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61034, 61064",
    "description": "Наріман Кербалаі Наджааф огли Наріманов (1870 - 1925) - радянський державний та партійний діяч, Голова Презиції ЦВК СРСР від ЗРФСР; Голова Ради Народних Комісарів Азербайджанської РСР; Народний комісар закордонних справ Азербайджанської РСР, брав участь у встановленні радянської влади у Закавказзі."
  },
  {
    "ukr_name": "Нехаєнка",
    "ukr_type": "вул.",
    "rus_name": "Нехаенко",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61037",
    "description": "Нехаєнко Григорій Петрович (?-1919) - учасник боротьби за радянську владу в Харкові, більшовик, командир червоноармійського загону ХПЗ."
  },
  {
    "ukr_name": "Новокомсомольська",
    "ukr_type": "вул.",
    "rus_name": "Новокомсомольская",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61045",
    "description": "Всесоюзний Ленінський комуністичний союз молоді (ВЛКСМ), або Комсомол — комуністичний молодіжний рух в СРСР, скорочення від «комуністичний союз молоді», структура КПРС для роботи з молоддю та виховання партійних кадрів."
  },
  {
    "ukr_name": "Ногіна",
    "ukr_type": "пров.",
    "rus_name": "Ногина",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61093",
    "description": "Ногін Віктор Павлович (1878 —1924) — російський революціонер, радянський партійний та державний діяч. Нарком у справах промисловості та торгівлі у першому радянському уряді, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Ногіна",
    "ukr_type": "пров.",
    "rus_name": "Ногина",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61157",
    "description": "Ногін Віктор Павлович (1878 —1924) — російський революціонер, радянський партійний та державний діяч. Нарком у справах промисловості та торгівлі у першому радянському уряді, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Ногіна",
    "ukr_type": "вул.",
    "rus_name": "Ногина",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61157",
    "description": "Ногін Віктор Павлович (1878 —1924) — російський революціонер, радянський партійний та державний діяч. Нарком у справах промисловості та торгівлі у першому радянському уряді, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Ольмінського",
    "ukr_type": "вул.",
    "rus_name": "Ольминского",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61024",
    "description": "Ольмінський Михайло Степанович (1863—1933), діяч революційного руху в Росії, активний учасник боротьби за Радянську владу в Москві, член Замоскворецького Віськово-революційного комітету. З грудня 1917 член колегії Наркомфіну. У 1918-20 член редколегії газети «Правда», з 1918 професор Соціалістичної, потім Комуністичної академії; член бригади лекторів в агітпоїздах ВЦИК і агітпоїзді «Жовтнева революція, делегат другого конгресу Комінтерну."
  },
  {
    "ukr_name": "Орджонікідзе",
    "ukr_type": "вул.",
    "rus_name": "Орджоникидзе",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": null,
    "description": "Орджонікідзе Григорій Костянтонович (Серго Орджонікідзе) (1886 —1937) — радянський державний і партійний діяч. 1-й секретар Закавказького крайкому РКП(б); з вересня 1926 року — 1-й секретар Північно- Кавказького крайкому РКП(б), нарком робітничо- селянської інспекції і заступником голови Раднаркому СРСР. З 1930 року голова Вищої ради народного господарства (ВРНГ СРСР) та член Політбюро ЦК ВКП(б)."
  },
  {
    "ukr_name": "Орджонікідзе",
    "ukr_type": "просп.",
    "rus_name": "Орджоникидзе",
    "rus_type": "просп.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61075",
    "description": "Орджонікідзе Григорій Костянтонович (Серго Орджонікідзе) (1886 —1937) — радянський державний і партійний діяч. 1-й секретар Закавказького крайкому РКП(б); з вересня 1926 року — 1-й секретар Північно- Кавказького крайкому РКП(б), нарком робітничо- селянської інспекції і заступником голови Раднаркому СРСР. З 1930 року голова Вищої ради народного господарства (ВРНГ СРСР) та член Політбюро ЦК ВКП(б)."
  },
  {
    "ukr_name": "Островського",
    "ukr_type": "пров.",
    "rus_name": "Островского",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Островський Микола Олексійович (1904-1936) - радянський військовий та партійний діяч, письменник; учасник встановлення радянської влади в Україні та боротьби з повстанським рухом, служив у бригаді І. Котовського,1-й кінній армії та Частинах особливого призначення Чевоної армії (ЧОН), співробітник Ізяславської ЧК (19191-1921), секретар райкому комсомолу в Берездові та Ізяславі, секретар окружкому комсомолу в Шепетівці (1924); бригадний комісар Політуправління Червоної армії (1936)."
  },
  {
    "ukr_name": "Островського",
    "ukr_type": "в-д",
    "rus_name": "Островского",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61013",
    "description": "Островський Микола Олексійович (1904-1936) - радянський військовий та партійний діяч, письменник; учасник встановлення радянської влади в Україні та боротьби з повстанським рухом, служив у бригаді І. Котовського,1-й кінній армії та Частинах особливого призначення Чевоної армії (ЧОН), співробітник Ізяславської ЧК (19191-1921), секретар райкому комсомолу в Берездові та Ізяславі, секретар окружкому комсомолу в Шепетівці (1924); бригадний комісар Політуправління Червоної армії (1936)."
  },
  {
    "ukr_name": "Островського",
    "ukr_type": "вул.",
    "rus_name": "Островского",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61137",
    "description": "Островський Микола Олексійович (1904-1936) - радянський військовий та партійний діяч, письменник; учасник встановлення радянської влади в Україні та боротьби з повстанським рухом, служив у бригаді І. Котовського,1-й кінній армії та Частинах особливого призначення Чевоної армії (ЧОН), співробітник Ізяславської ЧК (19191-1921), секретар райкому комсомолу в Берездові та Ізяславі, секретар окружкому комсомолу в Шепетівці (1924); бригадний комісар Політуправління Червоної армії (1936)."
  },
  {
    "ukr_name": "Пархоменка",
    "ukr_type": "вул.",
    "rus_name": "Пархоменко",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61046",
    "description": "Олександр Якович Пархоменко (1884-1921) — радянський військовий діяч, червоний командир. У 1919 році начальник більшовицького гарнізону Харкова, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Пархоменка",
    "ukr_type": "пров.",
    "rus_name": "Пархоменко",
    "rus_type": "пер.",
    "district": "Фрунзенський",
    "postcode": "61046",
    "description": "Олександр Якович Пархоменко (1884-1921) — радянський військовий діяч, червоний командир. У 1919 році начальник більшовицького гарнізону Харкова, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Пассіонарії",
    "ukr_type": "узв.",
    "rus_name": "Пассионарии",
    "rus_type": "сп.",
    "district": "Дзержинський",
    "postcode": "61022",
    "description": "Ісідора Долорес Іборрурі Ґомес (Пассіонарія) (1895 - 1989) — багаторічний перший секретар Комуністичної партії Іспанії. Один з лідерів іспанських республіканців під час Громадянської війни."
  },
  {
    "ukr_name": "Перовської",
    "ukr_type": "вул.",
    "rus_name": "Перовской",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61020, 61071",
    "description": "Перовська Софія Львівна (1853-1881) - російська революціонерка-народниця, терористка, організатор та учасниця вбивства імператора Олександра ІІ."
  },
  {
    "ukr_name": "Першої Кінної Армії",
    "ukr_type": "вул.",
    "rus_name": "Первой Конной Армии",
    "rus_type": "ул.",
    "district": "Жовтневий, Червонозаводський",
    "postcode": "61004, 61010, 61140",
    "description": "Перша кінна армія - вище оперативне об’єднання кавалерії Робітничо-селянської червоної армії, створене під час Громадянської війни в Росії 1918-1920 років, яке брало участь у встановленні радянської влади в Росії та Україні."
  },
  {
    "ukr_name": "Першої Маївки",
    "ukr_type": "вул.",
    "rus_name": "Первой Маевки",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61052",
    "description": "Перший масовий виступ робітників Харкова, підготовлене місцевим комітетом РСДРП 1 травня 1900 року."
  },
  {
    "ukr_name": "Першої Маївки",
    "ukr_type": "пров.",
    "rus_name": "Первой Маевки",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61017",
    "description": "Перший масовий виступ робітників Харкова, підготовлене місцевим комітетом РСДРП 1 травня 1900 року."
  },
  {
    "ukr_name": "Петровського",
    "ukr_type": "вул.",
    "rus_name": "Петровского",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002, 61024",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Петровського",
    "ukr_type": "в-д",
    "rus_name": "Петровского",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Петровського 1-й",
    "ukr_type": "в-д",
    "rus_name": "Петровского 1-й",
    "rus_type": "в-д",
    "district": "Дзержинський",
    "postcode": "61045",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Петровського 2-й",
    "ukr_type": "в-д",
    "rus_name": "Петровского 2-й",
    "rus_type": "в-д",
    "district": "Дзержинський",
    "postcode": "61045",
    "description": "Петровський Григорій Іванович (1878-1958) - радянський державний і політичний діяч. Був одним із ініціаторів створення ВЧК та організації Голодомору 1932-1933. У 1922 р. з боку УСРР підписав Договір про утворення СРСР. У 1922-1937 роках — один із заступників голови ЦВК СРСР. У 1937-1938 роках — заступник голови Президії Верховної Ради СРСР. У 1919-1938 роках — член Політбюро ЦК КП(б)У."
  },
  {
    "ukr_name": "Піонера",
    "ukr_type": "в-д",
    "rus_name": "Пионера",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Піонери - учасники масового дитячого комуністичного руху в СРСР, який мав на меті виховання дітей у відданості ідеалам комуністичної партії, радянської держави та її вождям."
  },
  {
    "ukr_name": "Піонерська",
    "ukr_type": "вул.",
    "rus_name": "Пионерская",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61044",
    "description": "Піонери - учасники масового дитячого комуністичного руху в СРСР, який мав на меті виховання дітей у відданості ідеалам комуністичної партії, радянської держави та її вождям."
  },
  {
    "ukr_name": "Плеханівська",
    "ukr_type": "вул.",
    "rus_name": "Плехановская",
    "rus_type": "ул.",
    "district": "Комінтернівський, Червонозаводський",
    "postcode": "61001, 61036, 61037, 61068",
    "description": "Плеханов Георгій Валентинович (1856-1918) - теоретик і пропагандист марксизму, філософ, діяч російського і міжнародного соціалістичного рухів. Один із засновників РСДРП та газети «Іскра», соратник"
  },
  {
    "ukr_name": "Плеханівський",
    "ukr_type": "пров.",
    "rus_name": "Плехановский",
    "rus_type": "пер.",
    "district": "Комінтернівський",
    "postcode": "61001",
    "description": "В. І. Леніна."
  },
  {
    "ukr_name": "Посівкомівська",
    "ukr_type": "вул.",
    "rus_name": "Посевкомовская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61064",
    "description": "Посівні комітети (посівкоми) - виконавчі органи радянської влади часів воєнного комунізму, створювалися постановою Раднаркому від 2 лютого 1919 року для контроль над посівними площами та врожаєм"
  },
  {
    "ukr_name": "Постишева",
    "ukr_type": "просп.",
    "rus_name": "Постышева",
    "rus_type": "просп.",
    "district": "Жовтневий",
    "postcode": "61020, 61039",
    "description": "Постишев Павло Петрович (1887-1939) - радянський партійний та державний діяч, Перший секретар Харківського обкому ВКП(б) (1933-1934), Перший секретар Київського обкому ВКП(б) (1934-1937), другий секрета ЦК КП(б)У (1933-1937). 13 січня 2010 року Апеляційний суд міста Києва, здійснивши попередній розгляд кримінальної справи № 1-33/2010, порушеної Службою безпеки України за фактом вчинення геноциду в Україні в 1932—1933 роках за ознаками злочину, передбаченого ч. 1 ст. 442 КК України, визнав Постишева винним у організації Голодомору та постановив наступне: «Підстав для реабілітації Постишева Павла Петровича немає»."
  },
  {
    "ukr_name": "Потапенка",
    "ukr_type": "вул.",
    "rus_name": "Потапенко",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Потапенко Пантелеймон Романович (?-1937) - радянський військовий діяч, командир 8-ї кавдивізії Червоного козацтва, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Правди",
    "ukr_type": "в-д",
    "rus_name": "Правды",
    "rus_type": "в-д",
    "district": "Дзержинський",
    "postcode": "61022",
    "description": "Назви на честь газеті «Правда» - головного друкованого органу ЦК КПРС"
  },
  {
    "ukr_name": "Правди",
    "ukr_type": "просп.",
    "rus_name": "Правды",
    "rus_type": "просп.",
    "district": "Дзержинський",
    "postcode": "61022, 61058",
    "description": "Назви на честь газеті «Правда» - головного друкованого органу ЦК КПРС"
  },
  {
    "ukr_name": "Правдинська",
    "ukr_type": "вул.",
    "rus_name": "Правдинская",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Назви на честь газеті «Правда» - головного друкованого органу ЦК КПРС"
  },
  {
    "ukr_name": "Примакова",
    "ukr_type": "вул.",
    "rus_name": "Примакова",
    "rus_type": "ул.",
    "district": "Жовтневий, Червонозаводський",
    "postcode": "61125",
    "description": "Примаков Віталій Маркович (1897-1937) - радянський військовий діяч, один з організаторів та керівників Червоного козацтва, учасник встановлення радянськоївлади в Україні та Середній Азії."
  },
  {
    "ukr_name": "Пролетарська",
    "ukr_type": "вул.",
    "rus_name": "Пролетарская",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61005",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Пролетарський",
    "ukr_type": "м-н",
    "rus_name": "Пролетарская",
    "rus_type": "пл.",
    "district": "Дзержинський, Червонозаводський",
    "postcode": "61003",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Пролетарський",
    "ukr_type": "узв.",
    "rus_name": "Пролетарский",
    "rus_type": "сп.",
    "district": "Київський, Московський",
    "postcode": "61161",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Пролетарський",
    "ukr_type": "пров.",
    "rus_name": "Пролетарский",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Профінтерну",
    "ukr_type": "вул.",
    "rus_name": "Профинтерна",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61044",
    "description": "Червоний інтернаціонал профспілок (Профінтерн) - міжнародна організація комуністичних та ліворадикальних профспілок, які не увійшли до Амстердамського інтернаціоналу. Створений у Москві у 1921 р., фактично перебував під контролем Іноземного відділу НКВС."
  },
  {
    "ukr_name": "П’ятдесятиріччя ВЛКСМ",
    "ukr_type": "просп.",
    "rus_name": "Пятидесятилетия ВЛКСМ",
    "rus_type": "просп.",
    "district": "Московський",
    "postcode": "61038, 61054, 61111, 61112, 61118, 61120, 61153",
    "description": "Назва на честь святкування 50-ї річниці створення Всесоюзного Ленінського комуністичного союз молоді"
  },
  {
    "ukr_name": "П’ятдесятиріччя СРСР",
    "ukr_type": "просп.",
    "rus_name": "Пятидесятилетия СССР",
    "rus_type": "просп.",
    "district": "Комінтернівський, Московський, Фрунзенський",
    "postcode": "61038, 61044, 61060, 61080, 61105, 61110, 61128, 61162",
    "description": "Назва на честь святкування 50-ї річниці створення Союзу Радянських Соціалістичних Республік"
  },
  {
    "ukr_name": "Радгоспна",
    "ukr_type": "вул.",
    "rus_name": "Совхозная",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61085",
    "description": "Радянські господарства - державне сільсько-господарське підприємство. За радянською теорією, найвища форма сільського господарства, сільсько-господарська фабрика, з націоналізованими засобами виробництва й найманою робочою силою. Створювались в Україні у 1920-х рр., масовими стали під час розгортання кампанії суцільної колективізації 1929-1933 рр."
  },
  {
    "ukr_name": "Радгоспний",
    "ukr_type": "пров.",
    "rus_name": "Совхозный",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61085",
    "description": "Радянські господарства - державне сільсько-господарське підприємство. За радянською теорією, найвища форма сільського господарства, сільсько-господарська фабрика, з націоналізованими засобами виробництва й найманою робочою силою. Створювались в Україні у 1920-х рр., масовими стали під час розгортання кампанії суцільної колективізації 1929-1933 рр."
  },
  {
    "ukr_name": "Раднаркомівська",
    "ukr_type": "вул.",
    "rus_name": "Совнаркомовская",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Рада народних комісарів - радянський уряд у 1917-1946 роках"
  },
  {
    "ukr_name": "Радянська",
    "ukr_type": "вул.",
    "rus_name": "Радянская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянський",
    "ukr_type": "в-д",
    "rus_name": "Радянский",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянський",
    "ukr_type": "м-н",
    "rus_name": "Советская",
    "rus_type": "пл.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянський",
    "ukr_type": "пров.",
    "rus_name": "Советский",
    "rus_type": "пер.",
    "district": "Дзержинський",
    "postcode": "61003",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянський 1-й",
    "ukr_type": "пров.",
    "rus_name": "Советский 1-й",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянський 2-й",
    "ukr_type": "пров.",
    "rus_name": "Советский 2-й",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Райкомівська",
    "ukr_type": "вул.",
    "rus_name": "Райкомовская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Районний комітет комуністичної партії (Райком) - назва місцевих органів партійно-державного апарату в СРСР."
  },
  {
    "ukr_name": "Райрадівський",
    "ukr_type": "пров.",
    "rus_name": "Райсоветский",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61125",
    "description": "Районний комітет комуністичної партії (Райком) - назва місцевих органів партійно-державного апарату в СРСР."
  },
  {
    "ukr_name": "Раковського",
    "ukr_type": "вул.",
    "rus_name": "Раковского",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": null,
    "description": "Раковський Християн Георгійович (1873-1941) - радянський державний та політичний діяч,голова Одеської та Севастопольської ВЧК (1918), голова Раднаркому УСРР (1919-1923), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Ревкомівська",
    "ukr_type": "вул.",
    "rus_name": "Ревкомовская",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61045, 61141",
    "description": "Революційний комітет - тимчасові надзвичайний орган радянської влади під час Громадянської війни 1918-1920 рр."
  },
  {
    "ukr_name": "Ревкомівський",
    "ukr_type": "пров.",
    "rus_name": "Ревкомовский",
    "rus_type": "пер.",
    "district": "Дзержинський",
    "postcode": "61141",
    "description": "Революційний комітет - тимчасові надзвичайний орган радянської влади під час Громадянської війни 1918-1920 рр."
  },
  {
    "ukr_name": "Революції",
    "ukr_type": "пров.",
    "rus_name": "Революции",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Радянська державна та партійна символіка. Названо на честь святкування 5-ї річниці Жовтневої революції у 1922 році."
  },
  {
    "ukr_name": "Революції",
    "ukr_type": "вул.",
    "rus_name": "Революции",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Радянська державна та партійна символіка. Названо на честь святкування 5-ї річниці Жовтневої революції у 1922 році."
  },
  {
    "ukr_name": "Революції 1905 року",
    "ukr_type": "узв.",
    "rus_name": "Революции 1905 года",
    "rus_type": "сп.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Радянська державна та партійна символіка. Вулиця отримала назву у 1936 р."
  },
  {
    "ukr_name": "Революції 1905 року",
    "ukr_type": "вул.",
    "rus_name": "Революции 1905 года",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61016",
    "description": "Радянська державна та партійна символіка. Вулиця отримала назву у 1936 р."
  },
  {
    "ukr_name": "Руднєва",
    "ukr_type": "м-н",
    "rus_name": "Руднева",
    "rus_type": "пл.",
    "district": "Червонозаводський",
    "postcode": "61050",
    "description": "Руднєв Микола Олександрович (1894-1918) - російський революціонер, радянський військовий діяч учасник встановлення радянської влади в Україні. Командував полком при спільному із загонами Червоної гвардії нападі на найважливіші об’єкти Харкова та роззброєнні українських військ Центральної ради. З лютого 1918 року — заступник наркома по військових справах Донецько-Криворізької Радянської республіки."
  },
  {
    "ukr_name": "Руднєва",
    "ukr_type": "вул.",
    "rus_name": "Руднева",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Руднєв Микола Олександрович (1894-1918) - російський революціонер, радянський військовий діяч учасник встановлення радянської влади в Україні. Командував полком при спільному із загонами Червоної гвардії нападі на найважливіші об’єкти Харкова та роззброєнні українських військ Центральної ради. З лютого 1918 року — заступник наркома по військових справах Донецько-Криворізької Радянської республіки."
  },
  {
    "ukr_name": "Руднєва",
    "ukr_type": "пров.",
    "rus_name": "Руднева",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Руднєв Микола Олександрович (1894-1918) - російський революціонер, радянський військовий діяч учасник встановлення радянської влади в Україні. Командував полком при спільному із загонами Червоної гвардії нападі на найважливіші об’єкти Харкова та роззброєнні українських військ Центральної ради. З лютого 1918 року — заступник наркома по військових справах Донецько-Криворізької Радянської республіки."
  },
  {
    "ukr_name": "Руднєва",
    "ukr_type": "в-д",
    "rus_name": "Руднева",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Руднєв Микола Олександрович (1894-1918) - російський революціонер, радянський військовий діяч учасник встановлення радянської влади в Україні. Командував полком при спільному із загонами Червоної гвардії нападі на найважливіші об’єкти Харкова та роззброєнні українських військ Центральної ради. З лютого 1918 року — заступник наркома по військових справах Донецько-Криворізької Радянської республіки."
  },
  {
    "ukr_name": "Саммеровський",
    "ukr_type": "пров.",
    "rus_name": "Саммеровский",
    "rus_type": "пер.",
    "district": "Дзержинський",
    "postcode": "61003",
    "description": "Саммер Іван Адамович (1870-1921) - російський революціонер, більшовик, учасник встановлення радянської влади в Росії та Україні, член колегії наркомфіну РСФРР (1919), член ВУЦВК та Раднаркому УСРР (1920-1921)."
  },
  {
    "ukr_name": "Сапельника",
    "ukr_type": "пров.",
    "rus_name": "Сапельника",
    "rus_type": "пер.",
    "district": "Комінтернівський",
    "postcode": "61001",
    "description": "Сапельник Максим Опанасович (?-1919) - учасник боротьби за встановлення радянської влади у Харкові, голова губвиконкому."
  },
  {
    "ukr_name": "Свердлова",
    "ukr_type": "пров.",
    "rus_name": "Свердлова",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61052",
    "description": "Свердлов Яков Михайлович (1885-1919) - радянський політичний і державний діяч, революціонер член ЦК РСДРП(б), РКП(б). Голова ВЦВК, один з ініціаторів розгону Установчих зборів, розкозачування та розстрілу імператорської родини."
  },
  {
    "ukr_name": "Селявкіна",
    "ukr_type": "вул.",
    "rus_name": "Селявкина",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61015",
    "description": "Селявкін Микола Іларіонович - учасник встановлення радянської влади в Україні, більшовик, командир 4-готанкового загону Червоної армії."
  },
  {
    "ukr_name": "Сербиченка",
    "ukr_type": "вул.",
    "rus_name": "Сербиченко",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Сербиченко Олександр Калістратович (1890-1938) - радянський партійний і державний діяч, учасник встановлення радянської влади в Україні, у 1930-х - заступник голови Раднаркому У СРР."
  },
  {
    "ukr_name": "Серп і Молот",
    "ukr_type": "вул.",
    "rus_name": "Серп и Молот",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61068",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Серп і Молот",
    "ukr_type": "пров.",
    "rus_name": "Серп и Молот",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61068",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Сіверса",
    "ukr_type": "вул.",
    "rus_name": "Сиверса",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Сіверс Рудольф Фердинандович (1892-1918) - радянський військовий діяч, учасник Громадянської війни та встановлені радянської влади в Україні."
  },
  {
    "ukr_name": "Сіверса",
    "ukr_type": "в-д",
    "rus_name": "Сиверса",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Сіверс Рудольф Фердинандович (1892-1918) - радянський військовий діяч, учасник Громадянської війни та встановлені радянської влади в Україні."
  },
  {
    "ukr_name": "Сімнадцятого Партз’їзду",
    "ukr_type": "вул.",
    "rus_name": "Семнадцатого Партсъезда",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61075, 61115",
    "description": "Названі на честь 17 партійного з’їзду ВКП (б), на якому прийняли резолюцію по плану 2-ої п ятирічки."
  },
  {
    "ukr_name": "Сімнадцятого Партз’їзду",
    "ukr_type": "пров.",
    "rus_name": "Семнадцатого Партсьезда",
    "rus_type": "пер.",
    "district": "Орджонікідзевський",
    "postcode": "61115",
    "description": "Названі на честь 17 партійного з’їзду ВКП (б), на якому прийняли резолюцію по плану 2-ої п ятирічки."
  },
  {
    "ukr_name": "Скорохода",
    "ukr_type": "вул.",
    "rus_name": "Скорохода",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61015, 61093",
    "description": "Скороход Олексій Георгійович (1879-1919) - революціонер, брав участь у встановлені радянської влади у Харкові."
  },
  {
    "ukr_name": "Слинька",
    "ukr_type": "вул.",
    "rus_name": "Слинько",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61096, 61100",
    "description": "Слинько Петро Федорович (1895-1919) - революціонер, керівник харківського більшовицького підпілля, брав участь у встановлені радянської влади у Харкові"
  },
  {
    "ukr_name": "Соколова",
    "ukr_type": "вул.",
    "rus_name": "Соколова",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61055, 61089, 61115",
    "description": "Соколов Іван Захарович (1928-1982) - радянський партійний діяч, перший секретар Орджонікідзевського райкому КПУ Харкова, з 1963 року — другий секретар, з 1972 року — перший секретар Харківського обкому партії; з 1976 року — другий секретар ЦК КПУ; з 1976 року — член ЦК КПРС; з 1966 року — кандидат у члени ЦК, з 1972 року — член ЦК КПУ; з 1973 року — кандидат у члени Політбюро ЦК, з 1976 року — членПолітбюро ЦК Компартії України."
  },
  {
    "ukr_name": "Соціалістична",
    "ukr_type": "вул.",
    "rus_name": "Социалистическая",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61093, 61098",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Соціалістичний",
    "ukr_type": "в-д",
    "rus_name": "Социалистический",
    "rus_type": "в-д",
    "district": "Ленінський",
    "postcode": "61093",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Соціалістичний",
    "ukr_type": "пров.",
    "rus_name": "Социалистический",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61098",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Союзна",
    "ukr_type": "вул.",
    "rus_name": "Союзная",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61070",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Союзний",
    "ukr_type": "пров.",
    "rus_name": "Союзний",
    "rus_type": "пер.",
    "district": "Жовтневий",
    "postcode": "61157",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Стасової Олени",
    "ukr_type": "вул.",
    "rus_name": "Стасовой Елени",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61161",
    "description": "Стасова Олена Дмитрівна (1873-1966) - радянська революціонерка, діяч міжнародного комуністичного руху, учасниця Жовтневого перевороту, секретар ЦК РКП(б) (1918—1920), член ЦК ВКП(б) (1930—1934). Голова Президіума ЦК КП Азербайджана"
  },
  {
    "ukr_name": "Стаханівська",
    "ukr_type": "вул.",
    "rus_name": "Стахановская",
    "rus_type": "ул.",
    "district": "Комінтернівський",
    "postcode": "61001",
    "description": "Стаханов Олексій Григорович (1906-1977) — засновник стахановського руху (Соціалістичне змагання) в промисловості та сільському господарстві. В подальшому його ім’я здобуло символічний характер, який уособлював успіхи радянського будівництва."
  },
  {
    "ukr_name": "Столєтова",
    "ukr_type": "вул.",
    "rus_name": "Столетова",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61110",
    "description": "Столєтов Всеволод Миколайович (1906-1989) - Радянський державний діяч, голова міністерства вищої освіти СРСР. Після його статті у «Правді» про «О вражеской науке» один з найстаріших агрономів країни, академік М. Тулайков, а також Г. Мейстер були розстріляні."
  },
  {
    "ukr_name": "Сусаніна Івана",
    "ukr_type": "вул.",
    "rus_name": "Сусанина Ивана",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Сусанін Іван - легендарний російський національний герой, костромський селянин к. XVI - п.ХУІІ ст. Згідно з легендою, у 1613 р. завів у болота польсько- литовський загін, де й загинув, врятувавши цим новообраного московського царя Михайла Романова. Професор М. І. Костомаров у статті «Иван Сусанин»"
  },
  {
    "ukr_name": "Сусаніна Івана",
    "ukr_type": "пров.",
    "rus_name": "Сусанина Ивана",
    "rus_type": "пер.",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Сусанін Іван - легендарний російський національний герой, костромський селянин к. XVI - п.ХУІІ ст. Згідно з легендою, у 1613 р. завів у болота польсько-литовський загін, де й загинув, врятувавши цим новообраного московського царя Михайла Романова. Професор М. І. Костомаров у статті «Иван Сусанин»"
  },
  {
    "ukr_name": "Тевелєва",
    "ukr_type": "вул.",
    "rus_name": "Тевелева",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61054",
    "description": "Тевелєв Яків (Мойсей) Сломонович (1890-1918) - революціонер, більшовик, член обкому Донецько-Криворізької Радянської республіки, брав участь у встановлені радянської влади у Харкові"
  },
  {
    "ukr_name": "Тевелєва",
    "ukr_type": "пров.",
    "rus_name": "Тевелева",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61054",
    "description": "Тевелєв Яків (Мойсей) Сломонович (1890-1918) - революціонер, більшовик, член обкому Донецько-Криворізької Радянської республіки, брав участь у встановлені радянської влади у Харкові"
  },
  {
    "ukr_name": "Тевелєва",
    "ukr_type": "в-д",
    "rus_name": "Тевелева",
    "rus_type": "в-д",
    "district": "Московський",
    "postcode": "61054",
    "description": "Тевелєв Яків (Мойсей) Сломонович (1890-1918) - революціонер, більшовик, член обкому Донецько-Криворізької Радянської республіки, брав участь у встановлені радянської влади у Харкові"
  },
  {
    "ukr_name": "Тельмана",
    "ukr_type": "вул.",
    "rus_name": "Тельмана",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61020",
    "description": "Тельман Ернст (1886-1944) - діяч німецького та міжнародного комуністичного рухів, голова Компартії Німеччини 1924-1933 рр."
  },
  {
    "ukr_name": "Тельмана",
    "ukr_type": "в-д",
    "rus_name": "Тельмана",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Тельман Ернст (1886-1944) - діяч німецького та міжнародного комуністичного рухів, голова Компартії Німеччини 1924-1933 рр."
  },
  {
    "ukr_name": "Тимурівців",
    "ukr_type": "вул.",
    "rus_name": "Тимуровцев",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61054, 61111, 61118, 61120, 61142, 61170",
    "description": "Тимурівці - члени піонерської організації, учасники руху послідовників персонажів твору А. Гайдара «Тимур та його команда»."
  },
  {
    "ukr_name": "Тінякова",
    "ukr_type": "вул.",
    "rus_name": "Тинякова",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61177",
    "description": "Тіняков Єфим Дмитрович (1893-1918) - більшовик, організатор створення червоноармійських загонів у Харкові, член агітколлегії Харківського міського і Доенцько-Криворіщзького обкомів РСДРП(б), брав участь у встановлені радянської влади у Харкові."
  },
  {
    "ukr_name": "Тіняковський 1-й",
    "ukr_type": "пров.",
    "rus_name": "Тиняковский 1-й",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61177",
    "description": "Тіняков Єфим Дмитрович (1893-1918) - більшовик, організатор створення червоноармійських загонів у Харкові, член агітколлегії Харківського міського і Доенцько-Криворіщзького обкомів РСДРП(б), брав участь у встановлені радянської влади у Харкові."
  },
  {
    "ukr_name": "Тіняковський 2-й",
    "ukr_type": "пров.",
    "rus_name": "Тиняковский 2-й",
    "rus_type": "пер.",
    "district": "Ленінський",
    "postcode": "61177",
    "description": "Тіняков Єфим Дмитрович (1893-1918) - більшовик, організатор створення червоноармійських загонів у Харкові, член агітколлегії Харківського міського і Доенцько-Криворіщзького обкомів РСДРП(б), брав участь у встановлені радянської влади у Харкові."
  },
  {
    "ukr_name": "Тореза",
    "ukr_type": "вул.",
    "rus_name": "Тореза",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61013",
    "description": "Торез Моріс (1900-1964)- діяч французького і міжнародного комуністичного руху, генеральний секретар Французької комуністичної партії. Заочно засуджений до страти за дезертирство з французької армії у 1940 р., у 1944 р. помилуваний президентом Де Голлем. Прихильник політики Й. Сталіна"
  },
  {
    "ukr_name": "Третього Інтернаціоналу",
    "ukr_type": "вул.",
    "rus_name": "Третьего Интернационала",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61075, 61115",
    "description": "Комуністичний Інтернаціонал (Комінтерн, Третій Інтернаціонал) - міжнародна організація комуністичних партій, яка керувалась Кремлем і знаходилась під повним контролем Іноземного Відділу НКВС. Заснована 1919 року в Москві за ініціативи В. І. Леніна, який оголосив «мертвим» Другий інтернаціонал після початку Першої світової війни 1914 року. Розпущений Й. Сталіним у 1943 р."
  },
  {
    "ukr_name": "Тухачевського",
    "ukr_type": "вул.",
    "rus_name": "Тухачевского",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61075",
    "description": "Тухачевський Михайло Михайлович (1893-1937)- радянський військовий діяч, командував придушенням Тамбовського повстання. З 1931 р. — заступник народного комісара військсправ і заступник голови Реввійськради СРСР, учасник встановлення радянської влади в Росії та Україні."
  },
  {
    "ukr_name": "Уборевіча",
    "ukr_type": "вул.",
    "rus_name": "Уборевича",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61129, 61136, 61144",
    "description": "Уборевич Ієронім Петрович (1896-1937) - радянський військовий і політичний діяч, командарм 1-го рангу. На керівних посадах у Червоній армії брав участь у становлені радянської влади в Україні."
  },
  {
    "ukr_name": "Ульянова Олександра",
    "ukr_type": "вул.",
    "rus_name": "Ульянова Александра",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61161",
    "description": "Ульянов Олександр Ілліч (1866-1887) - російський терорист, революціонер-народоволець, один з організаторів та керівників терористичної організації «Народна воля», організатор та учасник замаху на імператора Олександра ІІІ. Брат В. І. Леніна."
  },
  {
    "ukr_name": "Урицького",
    "ukr_type": "вул.",
    "rus_name": "Урицкого",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61125",
    "description": "Урицький Мойсей Соломонович (1873-1918) - російський революціонер, радянський політичний діяч, голова Петроградської надзвичайної комісії (ЧК) (1918), учасник встановлення радянської влади в Росії та організатор терору проти її противників."
  },
  {
    "ukr_name": "Урицького",
    "ukr_type": "пров.",
    "rus_name": "Урицкого",
    "rus_type": "пер.",
    "district": "Червонозаводський",
    "postcode": "61125",
    "description": "Урицький Мойсей Соломонович (1873-1918) - російський революціонер, радянський політичний діяч, голова Петроградської надзвичайної комісії (ЧК) (1918), учасник встановлення радянської влади в Росії та організатор терору проти її противників."
  },
  {
    "ukr_name": "Фабріціуса",
    "ukr_type": "вул.",
    "rus_name": "Фабрициуса",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61067",
    "description": "Фабріціус Ян Фріцевич (1877-1929) - радянський військовий діяч, більшовик, командир і комісар Червоної армії, латиський стрілок, брав участь у спробах встановлення радянської влади у Прибалтиці, встановленні радянської влади в Росії."
  },
  {
    "ukr_name": "Фіґнер",
    "ukr_type": "вул.",
    "rus_name": "Фигнер",
    "rus_type": "ул-",
    "district": "Жовтневий",
    "postcode": "61020",
    "description": "Фігнер Віра Миколаївна (1852 - 1942) — російська революціонерка,терористка член виконкому «Народної волі», організаторка та учасниця замахів на убивство імператора Олександра ІІ."
  },
  {
    "ukr_name": "Фрунзе",
    "ukr_type": "вул.",
    "rus_name": "Фрунзе",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Голова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Фрунзе",
    "ukr_type": "просп.",
    "rus_name": "Фрунзе",
    "rus_type": "просп.",
    "district": "Орджонікідзевський",
    "postcode": "61007, 61055, 61075, 61089",
    "description": "Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Голова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Фрунзе",
    "ukr_type": "в-д",
    "rus_name": "Фрунзе",
    "rus_type": "в-д",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Голова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Фрунзе сел.",
    "ukr_type": "*",
    "rus_name": "Фрунзе пос.",
    "rus_type": "*",
    "district": "Орджонікідзевський",
    "postcode": "61075",
    "description": "Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Голова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Фурманова",
    "ukr_type": "вул.",
    "rus_name": "Фурманова",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61161",
    "description": "Фурманов Дмитро Андрійович (1891-1926) - радянський військовий та політичний діяч, письменник, комісар 25-ї стрілецької дивізії Червоної армії (1919), учасник встановлення радянської влади в Росії та Середній Азії."
  },
  {
    "ukr_name": "Фурманова",
    "ukr_type": "в-д",
    "rus_name": "Фурманова",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61161",
    "description": "Фурманов Дмитро Андрійович (1891-1926) - радянський військовий та політичний діяч, письменник, комісар 25-ї стрілецької дивізії Червоної армії (1919), учасник встановлення радянської влади в Росії та Середній Азії."
  },
  {
    "ukr_name": "Халтуріна",
    "ukr_type": "вул.",
    "rus_name": "Халтурина",
    "rus_type": "ул.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Халтурін Степан Миколайович (1857-1882) - російський революціонер, терорист, оранізатор та виконавець замаху на імператора Олександра ІІ, в результаті якого загинули 11 та було поранено 56 осіб - солдатів-героїв російсько-турецької війни 1877-1878 рр., організатор та учасник убивства одеського військового прокурора В. Стрельнікова."
  },
  {
    "ukr_name": "Халтуріна",
    "ukr_type": "пров.",
    "rus_name": "Халтурина",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61038",
    "description": "Халтурін Степан Миколайович (1857-1882) - російський революціонер, терорист, оранізатор та виконавець замаху на імператора Олександра ІІ, в результаті якого загинули 11 та було поранено 56 осіб - солдатів-героїв російсько-турецької війни 1877-1878 рр., організатор та учасник убивства одеського військового прокурора В. Стрельнікова."
  },
  {
    "ukr_name": "Цюрупи",
    "ukr_type": "вул.",
    "rus_name": "Цюрупы",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039, 61064",
    "description": "Цюрупа Олександр Дмитрович (1870-1928) - радянський державний і партійний діяч, учасниквстановлення радянської влади в Росії, член ЦВК СРСР, народний комісар продовольства РСФРР (1918-1921), ініціатор запровадження продовольчої диктатури та створення продзагонів."
  },
  {
    "ukr_name": "Чапаєва",
    "ukr_type": "в-д",
    "rus_name": "Чапаева",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61125",
    "description": "Чапаєв Василь Іванович (1873-1919) - радянський військовий діяч, командир 25-ї стрілецької дивізії Червоної армії, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Чапаєва",
    "ukr_type": "наб.",
    "rus_name": "Чапаева",
    "rus_type": "наб.",
    "district": "Жовтневий",
    "postcode": "61125",
    "description": "Чапаєв Василь Іванович (1873-1919) - радянський військовий діяч, командир 25-ї стрілецької дивізії Червоної армії, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Чапаєва",
    "ukr_type": "вул.",
    "rus_name": "Чапаева",
    "rus_type": "ул.",
    "district": "Фрунзенський",
    "postcode": "61046",
    "description": "Чапаєв Василь Іванович (1873-1919) - радянський військовий діяч, командир 25-ї стрілецької дивізії Червоної армії, учасник встановлення радянської влади в Росії."
  },
  {
    "ukr_name": "Червона",
    "ukr_type": "вул.",
    "rus_name": "Червоная",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61035",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червона Алея",
    "ukr_type": "вул.",
    "rus_name": "Красная Аллея",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61019",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червона Алея",
    "ukr_type": "в-д",
    "rus_name": "Красная Аллея",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61019",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червона Алея 2-й",
    "ukr_type": "в-д",
    "rus_name": "Красная Аллея 2-й",
    "rus_type": "в-д",
    "district": "Жовтневий",
    "postcode": "61019",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоний",
    "ukr_type": "в-д",
    "rus_name": "Красний",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61033",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоних Старшин",
    "ukr_type": "вул.",
    "rus_name": "Красных Старшин",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61064",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоні Ряди",
    "ukr_type": "вул.",
    "rus_name": "Красные Ряды",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61012",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоноармійська",
    "ukr_type": "вул.",
    "rus_name": "Красноармейская",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61052",
    "description": "Червона армія (Робітничо-селянська червона армія) - збройні сили радянських республік, почала формуватись у 1918, використовувалась для встановлення радянської влади та боротьби з повстанським рузхом в Україні у 1918-1922 рр."
  },
  {
    "ukr_name": "Червоноармійський",
    "ukr_type": "пров.",
    "district": "Орджонікідзевський",
    "postcode": null,
    "description": "Червона армія (Робітничо-селянська червона армія) - збройні сили радянських республік, почала формуватись у 1918, використовувалась для встановлення радянської влади та боротьби з повстанським рузхом в Україні у 1918-1922 рр."
  },
  {
    "ukr_name": "Червоноармійський",
    "ukr_type": "в-д",
    "rus_name": "Красноармейский",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Червона армія (Робітничо-селянська червона армія) - збройні сили радянських республік, почала формуватись у 1918, використовувалась для встановлення радянської влади та боротьби з повстанським рузхом в Україні у 1918-1922 рр."
  },
  {
    "ukr_name": "Червонобаварська",
    "ukr_type": "вул.",
    "rus_name": "Краснобаварская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61137",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоного Жовтня",
    "ukr_type": "вул.",
    "rus_name": "Красного Октября",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61067",
    "description": "Назва на честь Жовтневого збройного перевороту 25 жовтня (7 листопада)1917 року"
  },
  {
    "ukr_name": "Червоного Козацтва",
    "ukr_type": "вул.",
    "rus_name": "Красного Казачества",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61010",
    "description": "Червоне козацтво - радянське збройне формування, створене у 1917-1918 рр. В. Примаковим для встановлення радянської влади в Україні. У 1918-1921 рр. Вели боротьбу проти збройних сил Української Народної Республіки, Української Держави та повстанців."
  },
  {
    "ukr_name": "Червоного Льотчика",
    "ukr_type": "вул.",
    "rus_name": "Красного Летчика",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61166",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоного Міліціонера",
    "ukr_type": "вул.",
    "rus_name": "Красного Милиционера",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61030",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоножовтнева",
    "ukr_type": "вул.",
    "rus_name": "Краснооктябрьская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61012, 61052, 61157",
    "description": "Назва на честь Жовтневого збройного перевороту 25 жовтня (7 листопада)1917 року"
  },
  {
    "ukr_name": "Червонозірська",
    "ukr_type": "вул.",
    "rus_name": "Краснозорская",
    "rus_type": "ул.",
    "district": "Дзержинський",
    "postcode": "61051",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоної Зірки",
    "ukr_type": "вул.",
    "rus_name": "Красной Звезды",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61009",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червонопартизанська",
    "ukr_type": "вул.",
    "rus_name": "Краснопартизанская",
    "rus_type": "ул.",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Червоні партизани - збройні формування, які брали участь у встановленні радянської влади в Україні у 1918-1919 рр. Вулиці названі у 1936 році."
  },
  {
    "ukr_name": "Червонопартизанський",
    "ukr_type": "пр-д",
    "rus_name": "Краснопартизанский",
    "rus_type": "пр-д",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Червоні партизани - збройні формування, які брали участь у встановленні радянської влади в Україні у 1918-1919 рр. Вулиці названі у 1936 році."
  },
  {
    "ukr_name": "Червонопартизанський",
    "ukr_type": "пров.",
    "rus_name": "Краснопартизанский",
    "rus_type": "пер.",
    "district": "Орджонікідзевський",
    "postcode": "61089",
    "description": "Червоні партизани - збройні формування, які брали участь у встановленні радянської влади в Україні у 1918-1919 рр. Вулиці названі у 1936 році."
  },
  {
    "ukr_name": "Червонопрапорна",
    "ukr_type": "вул.",
    "rus_name": "Краснознаменная",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червонопрапорний",
    "ukr_type": "пров.",
    "rus_name": "Краснознаменньїй",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоноселищна",
    "ukr_type": "вул.",
    "rus_name": "Червоноселищная",
    "rus_type": "ул.",
    "district": "Ленінський",
    "postcode": "61067",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоностудентський",
    "ukr_type": "в-д",
    "rus_name": "Красностуденческий",
    "rus_type": "в-д",
    "district": "Київський",
    "postcode": "61023",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоностудентський",
    "ukr_type": "пров.",
    "rus_name": "Красностуденческий",
    "rus_type": "пер.",
    "district": "Київський",
    "postcode": "61023",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червонофлотська",
    "ukr_type": "вул.",
    "rus_name": "Краснофлотская",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61034",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоношкільна",
    "ukr_type": "наб.",
    "rus_name": "Красношкольная",
    "rus_type": "наб.",
    "district": "Червонозаводський",
    "postcode": "61050, 61125",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Червоношляховий",
    "ukr_type": "пров.",
    "rus_name": "Червоношляховий",
    "rus_type": "пер.",
    "district": "Московський",
    "postcode": "61054",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Чернікова",
    "ukr_type": "вул.",
    "rus_name": "Черникова",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Черніков Олександр (?-1919) - революціонер, член більшовицького підпілля в Харкові, учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Чубаря",
    "ukr_type": "вул.",
    "rus_name": "Чубаря",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61002",
    "description": "Чубар Влас Якович (1891-1931) - радянський партійний і державний діяч, голова Ради Народних комісарів УСРР (1923-1934). 13 січня 2010 року Апеляційний суд міста Києва, здійснивши попередній розгляд кримінальної справи № 1-33/2010, порушеної Службою безпеки України за фактом вчинення геноциду в Україні в 1932—1933 роках за ознаками злочину, передбаченого ч. 1 ст. 442 КК України, визнав Чубаря винним у організації Голодомору та постановив наступне: «Підстав для реабілітації Чубаря Власа Яковича немає»."
  },
  {
    "ukr_name": "Шаумяна",
    "ukr_type": "вул.",
    "rus_name": "Шаумяна",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Шаумян Степан Георгійович (1878-1918) - радянський політичний діяч, член Бакинського Раднаркому, учасник встановлення радянської влади на Закавказзі."
  },
  {
    "ukr_name": "Шліхтера",
    "ukr_type": "вул.",
    "rus_name": "Шлихтера",
    "rus_type": "ул.",
    "district": "Київський",
    "postcode": "61107",
    "description": "Шліхтер Олександр Григорович (1868-1940) - радянський державний і партійний діяч, учасник встановлення радянської влади в Росії та Україні, народний комісар земельних справ, народний комісар продовольства (1917-1918), член Тимчасовогоробітничо-селянського уряду України (1918-1919), народний комісар продовольчих справ УСРР (1919), голова Тамбовського губвиконкому (1920-1921), придушував селянський повстанський рух."
  },
  {
    "ukr_name": "Щорса",
    "ukr_type": "вул.",
    "rus_name": "Щорса",
    "rus_type": "ул.",
    "district": "Жовтневий",
    "postcode": "61039",
    "description": "Щорс Микола Олександрович (1895-1919) - радянський військовий діяч, командир полку в складі Першої української радянської дивізії. Воював з військами УНР, брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Щорса",
    "ukr_type": "в-д",
    "rus_name": "Щорса",
    "rus_type": "в-д",
    "district": "Червонозаводський",
    "postcode": "61109",
    "description": "Щорс Микола Олександрович (1895-1919) - радянський військовий діяч, командир полку в складі Першої української радянської дивізії. Воював з військами УНР, брав участь у встановленні радянської влади в Україні."
  },
  {
    "ukr_name": "Юного Ленінця",
    "ukr_type": "вул.",
    "rus_name": "Юного Ленинца",
    "rus_type": "ул.",
    "district": "Червонозаводський",
    "postcode": "61140",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП - РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Якіра",
    "ukr_type": "вул.",
    "rus_name": "Якира",
    "rus_type": "ул.",
    "district": "Київський, Московський",
    "postcode": "61005, 61068, 61161",
    "description": "Якір Йона Еммануїлович (1896-1937) - радянський військовий діяч, учасник встановлення радянської влади в Україні, член Бессарабського губ ревкому (1917-1918), член Реввійськради 8-ї армії (1918), командир 45-ї стрілецької дивізії, придушував повстанський рух, член президії Кримського обкому РКП(б) (1921)."
  }
];

var districts = [
  {
    "ukr_name": "Дзержинський",
    "description": "Фелікс Едмундович Дзержинський (1877 — 1926) (Залізний Фелікс) — радянський політичний діяч, один із засновників Всеросійської надзвичайної комісії (ВЧК) та організаторів «червоного терору» в Радянській Росії та на захоплених Червоною армією територіях."
  },
  {
    "ukr_name": "Жовтневий",
    "description": "Назва на честь Жовтневого збройного перевороту 25 жовтня (7 листопада)1917 року"
  },
  {
    "ukr_name": "Комінтернівський",
    "description": "Комуністичний інтернаціонал (Комінтерн, Третій інтернаціонал) - міжнародна організація комуністичних партій, яка керувалась Кремлем і знаходилась під повним контролем Іноземного Відділу НКВС. Заснована 1919 року в Москві за ініціативи В. І. Леніна, який оголосив «мертвим» Другий інтернаціонал після початку Першої світової війни 1914 року. Розпущений Й. Сталіним у 1943 р."
  },
  {
    "ukr_name": "Ленінський",
    "description": "Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП -РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"
  },
  {
    "ukr_name": "Московський",
    "description": "В 1938 р. у Харкові створено Кагановицький та Сталінський райони, названі на честь очільниківвсесоюзної та республіканської (української) партійних організацій Й. Сталіна та Л. Кагановича. Під час здійснення політики десталінізації та подолання наслідків культу особи Сталіна Кагановицький район став Київським (1957), а Сталінський - Московським (1961). Зв’язку головний більшовик СРСР - головний більшовик УРСР було замінено на Столиця СРСР - Столиця УРСР."
  },
  {
    "ukr_name": "Орджонікідзевський",
    "description": "Орджонікідзе Григорій Костянтонович (Серго Орджонікідзе) (1886 —1937) — радянський державний і партійний діяч. 1-й секретар Закавказького крайкому РКП(б); з вересня 1926 року — 1-й секретар Північно- Кавказького крайкому РКП(б), нарком робітничо- селянської інспекції і заступником голови Раднаркому СРСР. З 1930 року голова Вищої ради народного господарства (ВРНГ СРСР) та член Політбюро ЦК ВКП(б)."
  },
  {
    "ukr_name": "Фрунзенський",
    "description": "Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Голова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленнірадянської влади в Україні."
  },
  {
    "ukr_name": "Червонозаводський",
    "description": "Радянська державна та партійна символіка"
  }
];
var metros = [
  {
    "ukr_name": "Пролетарська",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянська",
    "description": "Радянська державна та партійна символіка"
  },
  {
    "ukr_name": "Радянської армії",
    "description": "Радянська державна та партійна символіка"
  }
];
var parks = [
  {
    "ukr_name": "ім. Артема",
    "ukr_type": "парк",
    "district": "Комінтернівський",
    "description": "Артем (Федір Андрійович Сергеєв) (1883-1921) - радянський партійний та державний діяч, голова Раднаркому Донецько-Криворізької Радянської Республіки (1918), заступник голови і нарком радянської пропаганди Тимчасового робітничо-селянського уряду України (1918-1919), голова Донецького губвиконкому (1920), учасник встановлення радянської влади в Україні."
  },
  {
    "ukr_name": "Жовтневий гідропарк",
    "ukr_type": "парк",
    "district": "Жовтневий",
    "description": "Назва на честь Жовтневого збройного перевороту 25 жовтня (7 листопада) 1917 року"
  },
  {
    "ukr_name": "Піонерський парк",
    "ukr_type": "парк",
    "district": "Червонозаводський",
    "description": "Піонери - учасники масового дитячого комуністичного руху в СРСР, який мав на меті виховання дітей у відданості ідеалам комуністичної партії, радянської держави та її вождям."
  },
  {
    "ukr_name": "Радянської України",
    "ukr_type": "сквер",
    "district": "Орджонікідзевський",
    "description": "Радянська державна та партійна символіка"
  }
];

var all = {'streets': streets, 'districts': districts, 'metros': metros, 'parks': parks};
