[{"ukr_name":"Дзержинський","description":"Фелікс Едмундович Дзержинський (1877 — 1926) (Залізний Фелікс) — радянський політичний діяч, один із засновників Всеросійської надзвичайної комісії (ВЧК) та організаторів «червоного терору» в Радянській Росії та на захоплених Червоною армією територіях."},{"ukr_name":"Жовтневий","description":"Назва на честь Жовтневого збройного перевороту 25 жовтня (7 листопада)1917 року"},{"ukr_name":"Комінтернівський","description":"Комуністичний інтернаціонал (Комінтерн, Третій інтернаціонал) - міжнародна організація комуністичних партій, яка керувалась Кремлем і знаходилась під повним контролем Іноземного Відділу НКВС. Заснована 1919 року в Москві за ініціативи В. І. Леніна, який оголосив «мертвим» Другий інтернаціонал після початку Першої світової війни 1914 року. Розпущений Й. Сталіним у 1943 р."},{"ukr_name":"Ленінський","description":"Володимир Ілліч Ульянов (Ленін) - засновник радянської держави та комуністичної партії РСДРП -РКП(б) - ВКП(б) - КПРС. Один з організаторів Жовтневого збройного перевороту 1917 року, громадянської війни та червоного терору"},{"ukr_name":"Московський","description":"В 1938 р. у Харкові створено Кагановицький та Сталінський райони, названі на честь очільниківвсесоюзної та республіканської (української) партійних організацій Й. Сталіна та Л. Кагановича. Під час здійснення політики десталінізації та подолання наслідків культу особи Сталіна Кагановицький район став Київським (1957), а Сталінський - Московським (1961). Зв’язку головний більшовик СРСР - головний більшовик УРСР було замінено на Столиця СРСР - Столиця УРСР."},{"ukr_name":"Орджонікідзевський","description":"Орджонікідзе Григорій Костянтонович (Серго Орджонікідзе) (1886 —1937) — радянський державний і партійний діяч. 1-й секретар Закавказького крайкому РКП(б); з вересня 1926 року — 1-й секретар Північно- Кавказького крайкому РКП(б), нарком робітничо- селянської інспекції і заступником голови Раднаркому СРСР. З 1930 року голова Вищої ради народного господарства (ВРНГ СРСР) та член Політбюро ЦК ВКП(б)."},{"ukr_name":"Фрунзенський","description":"Фрунзе Михайло Васильович (1885-1925) — радянський військовий діяч, революціонер, один з воєначальників у Червоній Армії під час Громадянської війни. Г олова Реввійськради СРСР, нарком з військових і морських справ (1925). Керував розгромом Повстанської армії Нестора Махна (за що в 1924 нагороджений другим орденом Червоного Прапора) і загону Юрія Тютюнника. Брав участь у встановленнірадянської влади в Україні."},{"ukr_name":"Червонозаводський","description":"Радянська державна та партійна символіка"}]